{"id":855,"date":"2021-04-01T13:59:59","date_gmt":"2021-04-01T06:59:59","guid":{"rendered":"https:\/\/arabcomputers.com.sa\/?page_id=855"},"modified":"2022-04-23T13:28:25","modified_gmt":"2022-04-23T13:28:25","slug":"terms-and-conditions","status":"publish","type":"page","link":"https:\/\/arabcomputers.com.sa\/terms-and-conditions\/","title":{"rendered":"Terms and conditions"},"content":{"rendered":"\r\n<ol class=\"wp-block-list\">\r\n<li>In these Terms and Conditions, “Company” means Arab Computers (closed joint stock), “Customer” means the person, firm or company bringing an Apple Product (the “Product”) to the Company’s service centre in the Kingdom of Saudi Arabia for repair (the “Center”).<\/li>\r\n<li>Any Product placed for repair at the Center implies the full and unconditional acceptance of these Terms and Conditions by the Customer.<\/li>\r\n<li>The examination of the Product by the Company usually takes up to 3 working days. If the required spare parts are not available, the expected time to complete the service vary from 7 to 14 working days following completion of the examination.<\/li>\r\n<li>It is recommended that Customer back up the Product and wipe it, prior to submission for service. The Company shall not be responsible or held liable in the event any data is deleted or wiped during maintenance services being performed.<\/li>\r\n<li>All installed accessories on the Product, including packaging, protection screens and the SIM card, shall be removed upon delivering the Product for maintenance without any liability on the Company in case of damage or loss.<\/li>\r\n<li>As part of service, the Company may install system software updates that will prevent Customer Product from reverting to an earlier version of the system software. Third party applications installed on the Product may not be compatible or work as a result of the system software update.<\/li>\r\n<li>If the advance payment is made and the Customer agrees to repair out of warranty, the paid amount shall be deducted from the total value of the final repair.<\/li>\r\n<li>If the Customer wishes to authorize someone on his behalf to place the Product for repair, or deliver the Product, or collect the Product or pay for the services, the authorization shall be final and irreversible. The authorized person shall have the right to refuse or accept the offered value of the repair.<\/li>\r\n<li>The “Find My iPhone” feature shall be turned off upon delivering the Product. The Center is unable to perform maintenance, if the feature is not disabled and therefore the Company shall not be responsible for any delay in repair. If the Customer cannot disable this feature, please contact Apple Technical Support via the following numbers: STC: 8008449724<br \/>Zain and Mobily: 8008500032<\/li>\r\n<li>Text messages, emails, written consents, and conversations of all kinds shall be considered as approved means of communication with the Customer.<\/li>\r\n<li>In cases of replacing the Product or one of the internal parts or refunding the value, all the replaced or compensated parts shall be the property of the manufacturer being Apple. The Customer shall not be entitled to claim them, as the item becomes Apple’s property unless the Customer pays the full value of the Product and not the replacement value.<\/li>\r\n<li>It may not be possible to provide services for products that are not intended for sale in the Kingdom of Saudi Arabia, and in the event that services can be provided to such products, it shall be in compliance with the specifications available locally in the Kingdom of Saudi Arabia.<\/li>\r\n<li>The Company shall do its best effort to repair the Product, however the Company shall not be liable for Products that cannot be repaired or for any unjustified non-satisfaction of the Customer with the provided repair reports, estimates or repairs in general by the Company. The Company shall have the right, without referring to the Customer, to examine the Product and\/or disassemble it internally and externally, whether it is within or outside the warranty.<\/li>\r\n<li>Examining the product upon the delivery shall be considered as a “preliminary examination”, the Company’s employee registers the external status of the Product device only. After the technical examination, the Product condition, warranty and required repair shall be determined. If malfunctions are found due to the Product being subjected to external maintenance in non-approved centers, or exposed to liquid materials, cable cuts, fractures, faults and other factors, the service shall be refused or the repair shall be out of warranty after the Customer’s approval. In all cases, the Company reserves the right to return the Product to Customer without servicing it at any point during the repair process, and may hold the Customer responsible for any indicated diagnostic fee. The Company will not be responsible for any damage to the Product that occurs during the repair process that is a result of any unauthorized modifications or repairs or replacements not performed by Apple or an Apple Authorized Service Provider. If damage results, the Company will seek Customer’s authorization for any additional costs for completing service even if the Product is covered by warranty or an AppleCare service plan. If Customer decline authorization, the Company may return the Product unrepaired in the damaged condition without any responsibility.<\/li>\r\n<li>The Company understands that Customer’s data may be valuable to him\/her. Data loss during service is always a possibility, and in some cases, data may be unrecoverable, erased, or reformatted during service. For this reason, it is the Customer’s sole responsibility to back up all existing data, software, and\/or programs from his\/her Product, and to decide whether to erase any such data from the Product, prior to receiving service. The Company is not responsible for loss, recovery, or compromise of data, software or programs, or loss of use of the Product or other equipment arising out of the services provided by the Company. Customer represent that the Product does not contain any illegal files or data.<\/li>\r\n<li>The Customer shall not be entitled to claim the Product or compensation, if the Product is not received within thirty days from the time of notification the Customer is notified that his Product is ready, or ninety days from the date of delivering the Product to the maintenance Center, whatever the reasons. The Company shall have the right to dispose of the Product after the above-agreed period.<\/li>\r\n<li>The Customer shall pay the examination fees for the Product, if the out-of-warranty repair cost (expiring the coverage period, misuse, ear wax on AirPods) is not accepted, or if the Product is malfunctioned due to external maintenance in unapproved centers, or if we could not find the reported issue etc.:<br \/>200 SAR for Mac Devices.<br \/>50 SAR for AirPods.<br \/>100 SAR for the rest of Apple products.<br \/>(The prices do not include VAT).<\/li>\r\n<li>The applications and operating systems for the Products shall not be subjected to warranty. Therefore, the customer shall pay the factory reset fee:<br \/>200 SAR for Mac Devices.<br \/>50 SAR for AirPods.<br \/>100 SAR for the rest of Apple products.<br \/>(The prices do not include VAT).<\/li>\r\n<li>The Company shall have the right to impose a 100 SAR collection delay fee for keeping the Customer’s Product in the Center after 14 days of notifying the Customer that the Product is ready for collection, without prejudice to its right to resort to the official or judicial authorities to claim fair compensation.<\/li>\r\n<li>The prices of repairs for out-of-warranty service upon receiving the Product shall be considered as initial prices, and technical examination is required to ensure the eligibility of the service according to the terms. Repair prices may differ and increase in the event of non-original spare parts or other faults.<\/li>\r\n<li>The Customer shall provide and deliver the purchase invoice including all the Product details with the device in order to confirm the warranty status and provide the service.<\/li>\r\n<li>Some Apple products may not have replacement parts available, in that case it shall be completely replaced subject to the settlement by the Customer of a price difference.<\/li>\r\n<li>The service shall be provided according to the warranty policy provided by Apple, Customer can view it at the following link:<br \/><a href=\"http:\/\/www.apple.com\/legal\/warranty\">http:\/\/www.apple.com\/legal\/warranty<\/a><br \/><a href=\"https:\/\/www.apple.com\/legal\/sales-support\/terms\/repair\/generalservice\/servicetermsen\/\">https:\/\/www.apple.com\/legal\/sales-support\/terms\/repair\/generalservice\/servicetermsen\/<\/a><\/li>\r\n<li>Compliance with US export laws: Some products are restricted by the US government from exporting to certain countries and the Customer agrees not to distribute or re-export the products in violation of US export control laws or regulations. The Customer shall comply with all applicable export and import laws and regulations, including those of the United States, when marketing, exporting or importing products and technical data. The Customer shall confirm aware of, and undertake to comply with applicable export and import laws and regulations (including all necessary clearance requirements, export and import licenses, exemptions, and required deposits). The Customer shall agree to indemnify the Arab Computer Company and its suppliers for the claims against (Arab Computers Company) or the supplier for non-compliance by the Customer with the applicable export and import laws.<\/li>\r\n<li>The Customer shall be responsible for fully complying with the law of corrupt practices with foreign authorities. The Customer may not pay, offer, promise or give any valued thing to any employee, government official, government authority, political party or any other person, directly or indirectly. If the Customer realizes or has reason to believe that such money or value item will be passed on to one of the aforementioned to influence any action or decision by this person or by any government authority for the purpose of obtaining, maintaining or directing business to Arab Computers Company (including all affiliated and subsidiary companies) or their suppliers.<\/li>\r\n<li>If the Company is in breach of these Terms and conditions, it will only be responsible to the Customer for any loss of damage that Customer suffers to the extent that such loss or damage is directly related to the Product itself. The maximum extent of the Company’s liability as per the terms referred to herein shall be the replacement of the Product with a new similar product. Further, the Company and its affiliates, will not be liable to the Customer for any loss of revenue; loss of actual or anticipated profits (including loss of profits on contracts); loss of the use of money; loss of anticipated savings; loss of business; loss of opportunity; loss of goodwill; loss of reputation; loss of, damage to, or corruption of data; any consequential damages; or any costs of recovering, programming, or restoring any program or data stored or used with the Product and any failure to maintain the confidentiality of data stored on the Product.<\/li>\r\n<li>These Terms and Conditions are governed by English law and any dispute shall be resolved by way of arbitration as per the rules of the international chamber of commerce (the “Rules”) by one arbitrator appointed in accordance with such Rules. Arbitration shall be held in London, United Kingdom. Arbitration award shall be binding upon the Parties and may not be subject to appeal before any court of law.<\/li>\r\n<\/ol>\r\n","protected":false},"excerpt":{"rendered":"<p>In these Terms and Conditions, “Company” means Arab Computers (closed joint stock), “Customer” means the person, firm or company bringing an Apple Product (the “Product”) to the Company’s service centre in the Kingdom of Saudi Arabia for repair (the “Center”). Any Product placed for repair at the Center implies the full and unconditional acceptance of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":""},"class_list":["post-855","page","type-page","status-publish","hentry"],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/arabcomputers.com.sa\/wp-json\/wp\/v2\/pages\/855","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/arabcomputers.com.sa\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/arabcomputers.com.sa\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/arabcomputers.com.sa\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/arabcomputers.com.sa\/wp-json\/wp\/v2\/comments?post=855"}],"version-history":[{"count":3,"href":"https:\/\/arabcomputers.com.sa\/wp-json\/wp\/v2\/pages\/855\/revisions"}],"predecessor-version":[{"id":4110,"href":"https:\/\/arabcomputers.com.sa\/wp-json\/wp\/v2\/pages\/855\/revisions\/4110"}],"wp:attachment":[{"href":"https:\/\/arabcomputers.com.sa\/wp-json\/wp\/v2\/media?parent=855"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}